## Plan Result (notes-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11964417684)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/NotesAPI-Prod:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/NotesAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                      - {
                          - name      = "DATABASE_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU:host::"
                        },
                        {
                            name      = "DATABASE_NAME"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU:dbname::"
                        },
                        # (3 unchanged elements hidden)
                        {
                            name      = "DATABASE_USER"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU:username::"
                        },
                      + {
                          + name      = "DB_READ_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU:host::"
                        },
                      + {
                          + name      = "DB_WRITE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU:host::"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/NotesAPI/Prod/SENTRY_DSN"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "NotesAPI-Prod" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-notesapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "NotesAPI"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1 must be replaced
-/+ resource "aws_secretsmanager_secret_version" "rds_rds_secret_version_11D8C2B1" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:996905175585:secret:NotesAPI-Prod/notesapi-prod20241120220808668200000001-MDKdJU|terraform-20241120220901853100000004" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20241120220901853100000004" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/NotesAPI-Prod:1" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":971,"Program":"tfcmt","SHA1":"f77734496f2cf770fdd8eaa0b25c73af3fea0a5b","Target":"notes-api-cdk-production","Vars":{},"WorkflowName":"Notes API"} -->